---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InsertOverlapsOrOut
source: html/206e7d23-9a5b-7631-ac1d-895bdef74419.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InfillFailures.InsertOverlapsOrOut Property

Highlighted inserts overlap with other inserts or completely miss their hosts.

## Syntax (C#)
```csharp
public static FailureDefinitionId InsertOverlapsOrOut { get; }
```